# Distance Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
FabricWireItem..::..Distance Property
FabricWireItem Class See Also
---
Distance to the next fabric wire item Can be 0 to be used with offset along wire.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double Distance { get; set; }
```

Visual Basic
---
```text
Public Property Distance As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Distance {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The given value for distance is not a number |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for distance must be between 0 and 30000 feet. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
FabricWireItem Class
Autodesk.Revit.DB.Structure Namespace